AccumulationRegisters/ТТМ_УчетСерийныхНомеровПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТТМ_УчетСерийныхНомеровПродукции</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШильдЗаказан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Произведено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Реализовано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ХозяйственныеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ХозяйственныеОперации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПередачаВПроизводство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПеремещениеТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПеремещениеТоваровМеждуФилиалами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПередачаПродукцииИзПроизводства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПриемНаХранениеСПравомПродажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтгрузкаПринятыхСПравомПродажиТоваровСХранения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыОбеспечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВариантыОбеспечения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отгрузить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервироватьПоМереПоступления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОбеспечению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеТребуется</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыЗаказовКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыЗаказовКлиентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОбеспечению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеСогласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОтгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказКлиента</Name>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТТМ_ПланПроизводства</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИспользованиеХарактеристик</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыИспользованияХарактеристикНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ТТМ_Подписки/Ext/Module.bsl
#Область СерийныеНомера
 
Процедура ТТМ_РТУ_ПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	Если Источник.Проведен Тогда 
		
		Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда 
		    //Удалим сведения о реализации в регистре ТТМ_УчетСерийныхНомеров
			УчетСерийныхНомеров_Удалить_Привязку_Признак_Реализации_для_СН(Источник, Источник.ПометкаУдаления);
		КонецЕсли;	
		
	Иначе  
		Если Источник.этоновый() тогда
			Возврат;
		КонецЕсли;
		//Удалм признак реализации для привязанных серийных номеров 
		//Если ПометкаУдаления Тогда удалим и связь серийнфых номеров с документом реализации в регистре ТТМ_учетСерийныхНомеров
		УчетСерийныхНомеров_Удалить_Привязку_Признак_Реализации_для_СН(Источник, Источник.ПометкаУдаления);
		
	КонецЕсли;  
	
	
		
КонецПроцедуры

#Область ТТМ_ОтгрузкаТоваровСХранения

Процедура ТТМ_УстановитьПризнакРеализованоПоОтгрузкеСХранения(Источник, ЗначениеРеализовано) Экспорт
	Если Источник = Неопределено Тогда
		Возврат;
	КонецЕсли;

	КэшПриемок = Новый Соответствие;
	Для Каждого СтрТов Из Источник.Товары Цикл
		Если Не ЗначениеЗаполнено(СтрТов.ДокументПоступления)
			Или Не ЗначениеЗаполнено(СтрТов.Номенклатура)
			Или Не ЗначениеЗаполнено(СтрТов.СерийныйНомер) Тогда
			Продолжить;
		КонецЕсли;

		Набор = КэшПриемок.Получить(СтрТов.ДокументПоступления);
		Если Набор = Неопределено Тогда
			Набор = РегистрыНакопления.ТТМ_УчетСерийныхНомеровПродукции.СоздатьНаборЗаписей();
			Набор.Отбор.Регистратор.Установить(СтрТов.ДокументПоступления);
			Набор.Прочитать();
			КэшПриемок.Вставить(СтрТов.ДокументПоступления, Набор);
		КонецЕсли;

		Для Каждого СтрНЗ Из Набор Цикл
			Если СтрНЗ.ВидДвижения = ВидДвиженияНакопления.Приход
				И СтрНЗ.Номенклатура = СтрТов.Номенклатура
				И СтрНЗ.СерийныйНомер = СтрТов.СерийныйНомер Тогда
				Если Не ЗначениеЗаполнено(СтрТов.Назначение)
					Или СтрНЗ.Назначение = СтрТов.Назначение Тогда
					СтрНЗ.Реализовано = ЗначениеРеализовано;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	Для Каждого Пара Из КэшПриемок Цикл
		Попытка
			Пара.Значение.Записать();
		Исключение
			ВызватьИсключение "Ошибка при обновлении признака 'Реализовано' по сериям приемки: " + ОписаниеОшибки();
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

Процедура ТТМ_ОтгрузкаСХраненияПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения
		Или Источник.ПометкаУдаления Тогда
		Попытка
			ТТМ_УстановитьПризнакРеализованоПоОтгрузкеСХранения(Источник, Ложь);
		Исключение
			Отказ = Истина;
			Сообщить(ОписаниеОшибки());
			Возврат;
		КонецПопытки;

		НЗ = РегистрыНакопления.ТТМ_УчетСерийныхНомеровПродукции.СоздатьНаборЗаписей();
		НЗ.Отбор.Регистратор.Установить(Источник.Ссылка);
		НЗ.Прочитать();
		НЗ.Очистить();
		Попытка
			НЗ.Записать();
		Исключение
			Отказ = Истина;
			Сообщить("Ошибка при очистке серийных номеров отгрузки с хранения: " + ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

Процедура ТТМ_ОтгрузкаСХраненияОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	НЗ = РегистрыНакопления.ТТМ_УчетСерийныхНомеровПродукции.СоздатьНаборЗаписей();
	НЗ.Отбор.Регистратор.Установить(Источник.Ссылка);
	НЗ.Прочитать();
	НЗ.Очистить();

	Для Каждого СтрТов Из Источник.Товары Цикл
		Если Не ЗначениеЗаполнено(СтрТов.Номенклатура)
			Или Не ЗначениеЗаполнено(СтрТов.СерийныйНомер) Тогда
			Продолжить;
		КонецЕсли;

		НоваяЗапись = НЗ.Добавить();
		НоваяЗапись.Период = Источник.Дата;
		НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Расход;
		НоваяЗапись.Регистратор = Источник.Ссылка;
		НоваяЗапись.Склад = ?(ЗначениеЗаполнено(СтрТов.Склад), СтрТов.Склад, Источник.Склад);
		НоваяЗапись.Номенклатура = СтрТов.Номенклатура;
		НоваяЗапись.Назначение = ?(ЗначениеЗаполнено(СтрТов.Назначение), СтрТов.Назначение, Справочники.Назначения.ПустаяСсылка());
		НоваяЗапись.СерийныйНомер = СтрТов.СерийныйНомер;
		НоваяЗапись.ШильдЗаказан = Ложь;
		НоваяЗапись.Произведено = Ложь;
		НоваяЗапись.ДатаПроизводства = Дата(1, 1, 1);
		НоваяЗапись.ДокументРеализации = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
		НоваяЗапись.Реализовано = Ложь;
		НоваяЗапись.Количество = ?(ЗначениеЗаполнено(СтрТов.КоличествоУпаковок) И СтрТов.КоличествоУпаковок > 0, СтрТов.КоличествоУпаковок, 1);
	КонецЦикла;

	Попытка
		НЗ.Записать(Истина);
		ТТМ_УстановитьПризнакРеализованоПоОтгрузкеСХранения(Источник, Истина);
	Исключение
		Отказ = Истина;
		Сообщить("Ошибка при записи расхода серийных номеров по отгрузке с хранения: " + ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

#КонецОбласти

Процедура УчетСерийныхНомеров_Удалить_Привязку_Признак_Реализации_для_СН(Источник, ПометкаУдаления)
	
	//НачатьТранзакцию();
	//1. Исправим в строках по выпуску признак Реализовано 
	//1.1 Если Пометка на удаление, то удалим привязку СН к документу реадизации
	//2. Очистим строки по регистратору Истичник
	
	//1.
	//НайтиСтроки выпуска, привязанные к данной реализации и установить "Реализовано" = Ложь
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТТМ_УчетСерийныхНомеровПродукции.Регистратор КАК ЭтапПроизводства,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Склад КАК Склад,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Номенклатура КАК Номенклатура,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Назначение.Заказ КАК НазначениеЗаказ,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Назначение КАК Назначение,
	               |	ТТМ_УчетСерийныхНомеровПродукции.СерийныйНомер КАК СерийныйНомер,
	               |	ТТМ_УчетСерийныхНомеровПродукции.ШильдЗаказан КАК ШильдЗаказан,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Произведено КАК Произведено,
	               |	ТТМ_УчетСерийныхНомеровПродукции.ДатаПроизводства КАК ДатаПроизводства,
	               |	ТТМ_УчетСерийныхНомеровПродукции.ДокументРеализации КАК ДокументРеализации,
	               |	ЕСТЬNULL(ТТМ_УчетСерийныхНомеровПродукции.Реализовано, ЛОЖЬ) КАК Реализовано,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Количество КАК Количество
	               |ИЗ
	               |	РегистрНакопления.ТТМ_УчетСерийныхНомеровПродукции КАК ТТМ_УчетСерийныхНомеровПродукции
	               |ГДЕ
	               |	ТТМ_УчетСерийныхНомеровПродукции.ДокументРеализации = &ДокументРеализации
	               |	И ТТМ_УчетСерийныхНомеровПродукции.Регистратор ССЫЛКА Документ.ЭтапПроизводства2_2";
	Запрос.УстановитьПараметр("ДокументРеализации",Источник.Ссылка);
	РезультатЗапроса = Запрос.Выполнить(); 
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	ТЗ = РезультатЗапроса.Выгрузить();
	МассивЭтапов = ТЗ.ВыгрузитьКолонку("ЭтапПроизводства");
	НачатьТранзакцию();
	НЗ = РегистрыНакопления.ТТМ_УчетСерийныхНомеровПродукции.СоздатьНаборЗаписей();
	Для Каждого ЭтапПроизводства из МассивЭтапов Цикл 
		НЗ.Отбор.Регистратор.Установить(ЭтапПроизводства);
		НЗ.Прочитать();
		Для Каждого СтрСН из НЗ Цикл   
			//СтрСН.ДокументРеализации = Документы.РеализацияТоваровУслуг.ПустаяСсылка();  //!!!!!!!!! Удалить позже эту строку - Только для теста !!!!!!!!
			СтрСН.Реализовано = Ложь; 
			//1.1 Удалим привязку СН к реализации, если документ помечается на удаление
			Если ПометкаУдаления Тогда 
				СтрСН.ДокументРеализации = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
			КонецЕсли;
		КонецЦикла;   
		Попытка
			НЗ.Записать();
		Исключение               
			Сообщить("Ошибка при записи изменения признака Реализовано для Этапа " + ЭтапПроизводства);
			Отказ = Истина;
			ОтменитьТранзакцию();
		КонецПопытки;
	КонецЦикла;
	
	//2.
	НЗ_Реализации = РегистрыНакопления.ТТМ_УчетСерийныхНомеровПродукции.СоздатьНаборЗаписей();
	НЗ_Реализации.Отбор.Регистратор.Установить(Источник.Ссылка);
	НЗ_Реализации.Прочитать();
	НЗ_Реализации.Очистить();
	Попытка
		НЗ_Реализации.Записать(); 
		ЗафиксироватьТранзакцию();
	Исключение
		Сообщить("Ошибка при удалении записей по регистратору " + Источник.Ссылка);
		Отказ = Истина;
		ОтменитьТранзакцию();
	КонецПопытки;
	
	//ЗафиксироватьТранзакцию();
	
КонецПроцедуры

Процедура ТТМ1_РТУ_ОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт		//РТУ обработка проведения
	
	//1.Если проведённый, проверить необходимость(признак учета СН и дата начала СН позволяет) и наличие записи о серии
	//2.Если нужно - создать записи для соотв номенклатуры
	Если не Отказ Тогда
		ЕстьВсеСерии = Истина;	
		ТЗ_Серии = ТТМ_СерийныйУчет.ПроверитьНайтиСерийныйНомерПродукцииПриПродаже(Источник, ЕстьВсеСерии);
		Если ТЗ_Серии = Неопределено Тогда  
			//Учет серийных номеров не ведется ни для одной номенклатуры из Реализации 
			//или есть не все серии //сообщение при возврате из процедуры подбора СН на реализацию
			Если не ЕстьВсеСерии Тогда  //03.03.2026
				Отказ = Истина;  		//03.03.2026  
				Возврат;
			Иначе                       //03.03.2026
				Возврат;
			КонецЕсли;                 //03.03.2026
		КонецЕсли;
		Если ЕстьВсеСерии Тогда
			
			//Запишем сведения о реализации в текущий набор данных 
			НачатьТранзакцию();
			
			НЗЭтапы = РегистрыНакопления.ТТМ_УчетСерийныхНомеровПродукции.СоздатьНаборЗаписей();
			КоличествоРеализации = 0;
			Для Каждого СтрСН Из ТЗ_Серии Цикл   
				НЗЭтапы.Отбор.Регистратор.Установить(СтрСН.ЭтапПроизводства);
				НЗЭтапы.Прочитать();
				Для Каждого СтрНЗ из НЗЭтапы Цикл     
					ЗаполнитьЗначенияСвойств(СтрНЗ,СтрСН);
					Если не ЗначениеЗаполнено(СтрНЗ.ДокументРеализации) Тогда //или СтрСН.ДокументРеализации <> Источник.Ссылка 
						СтрНЗ.ДокументРеализации = Источник.Ссылка;
						СтрСН.Реализовано = Истина;
					Иначе
						Если СтрСН.ДокументРеализации = Источник.Ссылка Тогда 
							СтрСН.Реализовано = Истина;
						Иначе 
							Сообщить("Операция не выполнена! Для " + СтрСн.Номенклатура + " серийный номер " + СтрСН.СерийныйНомер + " уже привязан к реализации " + СтрСН.ДокументРеализации);
							Отказ = Истина;
							ОтменитьТранзакцию();
							Возврат;
						КонецЕсли;
					КонецЕсли; 
				КонецЦикла;       
				Попытка
					НЗЭтапы.Записать();
				Исключение 
					Сообщить("Ошибка записи регистра при дополнении информации об отгрузке! " + СтрСН.ЭтапПроизводства);
					Отказ = Истина;
					ОтменитьТранзакцию();
				КонецПопытки;
			КонецЦикла;   
						
			//Создадим записи регистра РТУ по сериям     
			НЗ = РегистрыНакопления.ТТМ_УчетСерийныхНомеровПродукции.СоздатьНаборЗаписей();
			НЗ.Отбор.Регистратор.Значение = Источник.Ссылка;
			НЗ.Загрузить(ТЗ_Серии);
			Для каждого стр из НЗ Цикл 
				стр.Период = Источник.Дата;
				стр.ВидДвижения = ВидДвиженияНакопления.Расход;
				стр.Регистратор = Источник.Ссылка;
				стр.ДокументРеализации = Источник.Ссылка;
				стр.Реализовано = Истина;
			КонецЦикла;           
			
			Попытка            
				НЗ.Записать(Истина);
				ЗафиксироватьТранзакцию();
			Исключение  
				Сообщить("Ошибка записи в регистр информации о резализации!");
				Отказ = Истина;
				ОтменитьТранзакцию();
			КонецПопытки;
		Иначе                               
			ОбщегоНазначения.СообщитьПользователю("Готовы не все серийные номера для реализации товаров!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры   

///////////////////////////////////////////////////////////////////////////////////
//17.07.2025   
Процедура ТТМ_ПередачаПродукцииПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если не Источник.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаПродукцииИзПроизводства Тогда 
		Возврат;                                                   
	КонецЕсли;    
	
	ТабТовары = Источник.Товары.Выгрузить();
	УчетСерий = ТТМ_СерийныйУчет.ПроверитьУстановитьУчетСерийныхНомеров(ТабТовары[0].Номенклатура);
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 

		НЗ = РегистрыНакопления.ТТМ_УчетСерийныхНомеровПродукции.СоздатьНаборЗаписей();
		НЗ.Отбор.Регистратор.Установить(Источник.Распоряжение);
		НЗ.Прочитать();
		
		Если НЗ.Количество() = 0 Тогда 
			//Отсутствуют зарегистрированые серийные номера для этапа производства
			Возврат;
		КонецЕсли;
		
		ТабСерийныеНомера = НЗ.Выгрузить();
		ТабСерийныеНомера.Сортировать("СерийныйНомер возр");
		ПараметрыПодбора = Новый Структура("Произведено", Ложь);
		МассивНайденныхСтрок = ТабСерийныеНомера.НайтиСтроки(ПараметрыПодбора);  
		
		КоличествоВыпускаемыхИзделий = ТабТовары.Итог("Количество");
		Если МассивНайденныхСтрок.Количество() < КоличествоВыпускаемыхИзделий = ТабТовары.Итог("Количество") Тогда 
			Сообщить("НЕдостаточно зарегистрированных серийных номеров для выпуска продукции");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Для н = 1 по КоличествоВыпускаемыхИзделий Цикл 
			МассивНайденныхСтрок[н-1].Произведено = Истина;
			МассивНайденныхСтрок[н-1].ДатаПроизводства = Источник.Дата;
		КонецЦикла;  
		НЗ.Загрузить(ТабСерийныеНомера);
		Попытка
			НЗ.Записать()
		Исключение
			Сообщить("Ошибка при записи данных о производстве в регистр Учет серийных номеров " + ОписаниеОшибки());
			Отказ = Истина;
		КонецПопытки;
		
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда 
		
		НЗ = РегистрыНакопления.ТТМ_УчетСерийныхНомеровПродукции.СоздатьНаборЗаписей();
		НЗ.Отбор.Регистратор.Установить(Источник.Распоряжение);  
		НЗ.Прочитать();                                                           
		
		Если НЗ.Количество() = 0 Тогда 
			//Отсутствуют зарегистрированые серийные номера для этапа производства
			Возврат;                                                              
		КонецЕсли;
		
		ТабСерийныеНомера = НЗ.Выгрузить();
		ТабСерийныеНомера.Сортировать("СерийныйНомер убыв");
		ПараметрыПодбора = Новый Структура("Произведено, ДатаПроизводства", Истина, НачалоДня(Источник.Дата));
		МассивНайденныхСтрок = ТабСерийныеНомера.НайтиСтроки(ПараметрыПодбора);
		
		КоличествоОтменяемыхИзделий = ТабТовары.Итог("Количество");
		Если МассивНайденныхСтрок.Количество() < КоличествоОтменяемыхИзделий Тогда                   
			Сообщить("Недостаточно зарегистрировано выпущенных серийных номеров для отмены выпуска продукции");
			Отказ = Истина;
			Возврат;
		КонецЕсли;   
		
		Для н = 1 по КоличествоОтменяемыхИзделий Цикл 
			МассивНайденныхСтрок[н-1].Произведено = Ложь;
			МассивНайденныхСтрок[н-1].ДатаПроизводства = Дата(1,1,1);
		КонецЦикла;  
		НЗ.Загрузить(ТабСерийныеНомера);
		Попытка
			НЗ.Записать()
		Исключение
			Сообщить("Ошибка при отмене производства продукции в регистр Учет серийных номеров " + ОписаниеОшибки());
			Отказ = Истина;
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти  

#Область ЗаказКлиентаСортировкаТоваров

Процедура ТТМ_ЗаказКлиентаСортировкаТоваровПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	////Если Источник.Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт Тогда 
	////	Возврат;
	////КонецЕсли;
	СортироватьТоварыЗаказаНаСервере(Источник);
	
КонецПроцедуры  
 
Процедура СортироватьТоварыЗаказаНаСервере(Источник)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказКлиентаТовары.НомерСтроки КАК НомерСтроки,
	               |	ЗаказКлиентаТовары.ДатаОтгрузки КАК ДатаОтгрузки,
	               |	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	               |	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
	               |	ЗаказКлиентаТовары.Упаковка КАК Упаковка,
	               |	ЗаказКлиентаТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	               |	ЗаказКлиентаТовары.Количество КАК Количество,
	               |	ЗаказКлиентаТовары.ВидЦены КАК ВидЦены,
	               |	ЗаказКлиентаТовары.Цена КАК Цена,
	               |	ЗаказКлиентаТовары.Сумма КАК Сумма,
	               |	ЗаказКлиентаТовары.СтавкаНДС КАК СтавкаНДС,
	               |	ЗаказКлиентаТовары.СуммаНДС КАК СуммаНДС,
	               |	ЗаказКлиентаТовары.СуммаСНДС КАК СуммаСНДС,
	               |	ЗаказКлиентаТовары.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	               |	ЗаказКлиентаТовары.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	               |	ЗаказКлиентаТовары.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
	               |	ЗаказКлиентаТовары.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
	               |	ЗаказКлиентаТовары.ПричинаОтмены КАК ПричинаОтмены,
	               |	ЗаказКлиентаТовары.КодСтроки КАК КодСтроки,
	               |	ЗаказКлиентаТовары.Отменено КАК Отменено,
	               |	ЗаказКлиентаТовары.КлючСвязи КАК КлючСвязи,
	               |	ЗаказКлиентаТовары.Склад КАК Склад,
	               |	ЗаказКлиентаТовары.СрокПоставки КАК СрокПоставки,
	               |	ЗаказКлиентаТовары.Содержание КАК Содержание,
	               |	ЗаказКлиентаТовары.СтатусУказанияСерий КАК СтатусУказанияСерий,
	               |	ЗаказКлиентаТовары.ВариантОбеспечения КАК ВариантОбеспечения,
	               |	ЗаказКлиентаТовары.Серия КАК Серия,
	               |	ЗаказКлиентаТовары.НоменклатураНабора КАК НоменклатураНабора,
	               |	ЗаказКлиентаТовары.Обособленно КАК Обособленно,
	               |	ЗаказКлиентаТовары.ХарактеристикаНабора КАК ХарактеристикаНабора,
	               |	ЗаказКлиентаТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	               |	ЗаказКлиентаТовары.Подразделение КАК Подразделение,
	               |	ЗаказКлиентаТовары.НоменклатураПартнера КАК НоменклатураПартнера,
	               |	ЗаказКлиентаТовары.СуммаБонусныхБалловКСписанию КАК СуммаБонусныхБалловКСписанию,
	               |	ЗаказКлиентаТовары.СуммаБонусныхБалловКСписаниюВВалюте КАК СуммаБонусныхБалловКСписаниюВВалюте,
	               |	ЗаказКлиентаТовары.СуммаНачисленныхБонусныхБалловВВалюте КАК СуммаНачисленныхБонусныхБалловВВалюте
	               |ПОМЕСТИТЬ ТЧТоварыЗаказа
	               |ИЗ
	               |	&ТоварыЗаказа КАК ЗаказКлиентаТовары
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ТЧТоварыЗаказа.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.НеТребуется)
	               |			ТОГДА 6
	               |		КОГДА ТЧТоварыЗаказа.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.ПереданРанее)
	               |			ТОГДА 5
	               |		КОГДА ТЧТоварыЗаказа.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
	               |			ТОГДА 4
	               |		КОГДА ТЧТоварыЗаказа.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления)
	               |			ТОГДА 3
	               |		КОГДА ТЧТоварыЗаказа.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	               |			ТОГДА 2
	               |		КОГДА ТЧТоварыЗаказа.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
	               |			ТОГДА 1
	               |	КОНЕЦ КАК ВариантОбеспечениядляСортировки,
	               |	ТЧТоварыЗаказа.НомерСтроки КАК НомерСтроки,
	               |	ТЧТоварыЗаказа.ДатаОтгрузки КАК ДатаОтгрузки,
	               |	ТЧТоварыЗаказа.Номенклатура КАК Номенклатура,
	               |	ТЧТоварыЗаказа.Характеристика КАК Характеристика,
	               |	ТЧТоварыЗаказа.Упаковка КАК Упаковка,
	               |	ТЧТоварыЗаказа.КоличествоУпаковок КАК КоличествоУпаковок,
	               |	ТЧТоварыЗаказа.Количество КАК Количество,
	               |	ТЧТоварыЗаказа.ВидЦены КАК ВидЦены,
	               |	ТЧТоварыЗаказа.Цена КАК Цена,
	               |	ТЧТоварыЗаказа.Сумма КАК Сумма,
	               |	ТЧТоварыЗаказа.СтавкаНДС КАК СтавкаНДС,
	               |	ТЧТоварыЗаказа.СуммаНДС КАК СуммаНДС,
	               |	ТЧТоварыЗаказа.СуммаСНДС КАК СуммаСНДС,
	               |	ТЧТоварыЗаказа.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	               |	ТЧТоварыЗаказа.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	               |	ТЧТоварыЗаказа.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
	               |	ТЧТоварыЗаказа.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
	               |	ТЧТоварыЗаказа.ПричинаОтмены КАК ПричинаОтмены,
	               |	ТЧТоварыЗаказа.КодСтроки КАК КодСтроки,
	               |	ТЧТоварыЗаказа.Отменено КАК Отменено,
	               |	ТЧТоварыЗаказа.КлючСвязи КАК КлючСвязи,
	               |	ТЧТоварыЗаказа.Склад КАК Склад,
	               |	ТЧТоварыЗаказа.СрокПоставки КАК СрокПоставки,
	               |	ТЧТоварыЗаказа.Содержание КАК Содержание,
	               |	ТЧТоварыЗаказа.СтатусУказанияСерий КАК СтатусУказанияСерий,
	               |	ТЧТоварыЗаказа.ВариантОбеспечения КАК ВариантОбеспечения,
	               |	ТЧТоварыЗаказа.Серия КАК Серия,
	               |	ТЧТоварыЗаказа.НоменклатураНабора КАК НоменклатураНабора,
	               |	ТЧТоварыЗаказа.Обособленно КАК Обособленно,
	               |	ТЧТоварыЗаказа.ХарактеристикаНабора КАК ХарактеристикаНабора,
	               |	ТЧТоварыЗаказа.ИдентификаторСтроки КАК ИдентификаторСтроки,
	               |	ТЧТоварыЗаказа.Подразделение КАК Подразделение,
	               |	ТЧТоварыЗаказа.НоменклатураПартнера КАК НоменклатураПартнера,
	               |	ТЧТоварыЗаказа.СуммаБонусныхБалловКСписанию КАК СуммаБонусныхБалловКСписанию,
	               |	ТЧТоварыЗаказа.СуммаБонусныхБалловКСписаниюВВалюте КАК СуммаБонусныхБалловКСписаниюВВалюте,
	               |	ТЧТоварыЗаказа.СуммаНачисленныхБонусныхБалловВВалюте КАК СуммаНачисленныхБонусныхБалловВВалюте
	               |ПОМЕСТИТЬ ВТТоварыЗаказа
	               |ИЗ
	               |	ТЧТоварыЗаказа КАК ТЧТоварыЗаказа
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТТоварыЗаказа.ВариантОбеспечениядляСортировки КАК ВариантОбеспечениядляСортировки,
	               |	ВТТоварыЗаказа.Отменено КАК Отменено,
	               |	ВТТоварыЗаказа.НомерСтроки КАК НомерСтроки,
	               |	ВТТоварыЗаказа.ДатаОтгрузки КАК ДатаОтгрузки,
	               |	ВТТоварыЗаказа.Номенклатура КАК Номенклатура,
	               |	ВТТоварыЗаказа.Характеристика КАК Характеристика,
	               |	ВТТоварыЗаказа.Упаковка КАК Упаковка,
	               |	ВТТоварыЗаказа.КоличествоУпаковок КАК КоличествоУпаковок,
	               |	ВТТоварыЗаказа.Количество КАК Количество,
	               |	ВТТоварыЗаказа.ВидЦены КАК ВидЦены,
	               |	ВТТоварыЗаказа.Цена КАК Цена,
	               |	ВТТоварыЗаказа.Сумма КАК Сумма,
	               |	ВТТоварыЗаказа.СтавкаНДС КАК СтавкаНДС,
	               |	ВТТоварыЗаказа.СуммаНДС КАК СуммаНДС,
	               |	ВТТоварыЗаказа.СуммаСНДС КАК СуммаСНДС,
	               |	ВТТоварыЗаказа.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	               |	ВТТоварыЗаказа.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	               |	ВТТоварыЗаказа.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
	               |	ВТТоварыЗаказа.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
	               |	ВТТоварыЗаказа.ПричинаОтмены КАК ПричинаОтмены,
	               |	ВТТоварыЗаказа.КодСтроки КАК КодСтроки,
	               |	ВТТоварыЗаказа.КлючСвязи КАК КлючСвязи,
	               |	ВТТоварыЗаказа.Склад КАК Склад,
	               |	ВТТоварыЗаказа.СрокПоставки КАК СрокПоставки,
	               |	ВТТоварыЗаказа.Содержание КАК Содержание,
	               |	ВТТоварыЗаказа.СтатусУказанияСерий КАК СтатусУказанияСерий,
	               |	ВТТоварыЗаказа.Серия КАК Серия,
	               |	ВТТоварыЗаказа.НоменклатураНабора КАК НоменклатураНабора,
	               |	ВТТоварыЗаказа.Обособленно КАК Обособленно,
	               |	ВТТоварыЗаказа.ХарактеристикаНабора КАК ХарактеристикаНабора,
	               |	ВТТоварыЗаказа.ИдентификаторСтроки КАК ИдентификаторСтроки,
	               |	ВТТоварыЗаказа.Подразделение КАК Подразделение,
	               |	ВТТоварыЗаказа.НоменклатураПартнера КАК НоменклатураПартнера,
	               |	ВТТоварыЗаказа.СуммаБонусныхБалловКСписанию КАК СуммаБонусныхБалловКСписанию,
	               |	ВТТоварыЗаказа.СуммаБонусныхБалловКСписаниюВВалюте КАК СуммаБонусныхБалловКСписаниюВВалюте,
	               |	ВТТоварыЗаказа.СуммаНачисленныхБонусныхБалловВВалюте КАК СуммаНачисленныхБонусныхБалловВВалюте,
				   |	ВТТоварыЗаказа.ВариантОбеспечения КАК ВариантОбеспечения
	               |ИЗ
	               |	ВТТоварыЗаказа КАК ВТТоварыЗаказа
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Отменено,
	               |	ВариантОбеспечениядляСортировки,
	               |	Номенклатура,
	               |	ДатаОтгрузки
	               |АВТОУПОРЯДОЧИВАНИЕ"; 
	
	Запрос.УстановитьПараметр("ТоварыЗаказа", Источник.Товары.Выгрузить()); 
	Запрос.УстановитьПараметр("СсылкаНаЗаказ", Источник.Ссылка); 
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	ТЗ.Колонки.Удалить(0); 
	Источник.Товары.Загрузить(ТЗ);   
		
КонецПроцедуры

#КонецОбласти  

#Область НеИспользуется
 
Функция ПроверитьНайтиСерийныйНомерПродукцииПриПродаже_Резерв(ИсточникРТУ, ЕстьВсеСерии = Истина)
	// Код написан для случая когда результатом этапа является одна номенклатурная позиция
	// количество может быть больше одного
	
	ТЗТовары = ИсточникРТУ.Товары.Выгрузить(,"Номенклатура,Количество");
	ТЗТовары.Свернуть("Номенклатура","Количество");
	
	Заказ = ИсточникРТУ.ЗаказКлиента;
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВсеТоварыРеализации.Номенклатура КАК Номенклатура,
	               |	ВсеТоварыРеализации.КоличествоУпаковок КАК КоличествоУпаковок
	               |ПОМЕСТИТЬ ВсеТоварыРеализации
	               |ИЗ
	               |	&ТоварыРеализации КАК ВсеТоварыРеализации
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВсеТоварыРеализации.Номенклатура КАК Номенклатура,
	               |	СУММА(ВсеТоварыРеализации.КоличествоУпаковок) КАК КоличествоУпаковок
	               |ПОМЕСТИТЬ СерийныеТоварыРеализации
	               |ИЗ
	               |	ВсеТоварыРеализации КАК ВсеТоварыРеализации
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	               |		ПО ВсеТоварыРеализации.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	               |ГДЕ
	               |	НоменклатураДополнительныеРеквизиты.Свойство = &ДопРеквизитУчетСерий
	               |	И НоменклатураДополнительныеРеквизиты.Значение = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВсеТоварыРеализации.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.Склад КАК Склад,
	               |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.Номенклатура КАК Номенклатура,
	               |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.Назначение.Заказ КАК НазначениеЗаказ,
	               |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.Назначение КАК Назначение,
	               |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.СерийныйНомер КАК СерийныйНомер,
	               |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.ШильдЗаказан КАК ШильдЗаказан,
	               |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.Произведено КАК Произведено,
	               |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.ДатаПроизводства КАК ДатаПроизводства,
	               |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.ДокументРеализации КАК ДокументРеализации,
	               |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.КоличествоОстаток КАК Количество,
	               |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.Реализовано КАК Реализовано,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Регистратор КАК ЭтапПроизводства,
	               |	СерийныеТоварыРеализации.КоличествоУпаковок КАК КоличествоРеализации
	               |ИЗ
	               |	РегистрНакопления.ТТМ_УчетСерийныхНомеровПродукции.Остатки(
	               |			,
	               |			Склад = &Склад
	               |				И Номенклатура В (&Номенклатура)
	               |				И Назначение.Заказ = &Заказ
	               |				И Произведено
	               |				И НАЧАЛОПЕРИОДА(ДатаПроизводства, ДЕНЬ) <= НАЧАЛОПЕРИОДА(&ДатаРеализации, ДЕНЬ)
	               |				И ДокументРеализации = &Реализация) КАК ТТМ_УчетСерийныхНомеровПродукцииОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТТМ_УчетСерийныхНомеровПродукции КАК ТТМ_УчетСерийныхНомеровПродукции
	               |		ПО (ТТМ_УчетСерийныхНомеровПродукции.Номенклатура = ТТМ_УчетСерийныхНомеровПродукцииОстатки.Номенклатура)
	               |			И (ТТМ_УчетСерийныхНомеровПродукции.Назначение = ТТМ_УчетСерийныхНомеровПродукцииОстатки.Назначение)
	               |			И (ТТМ_УчетСерийныхНомеровПродукции.СерийныйНомер = ТТМ_УчетСерийныхНомеровПродукцииОстатки.СерийныйНомер)
	               |			И (ТТМ_УчетСерийныхНомеровПродукции.ДокументРеализации = ТТМ_УчетСерийныхНомеровПродукцииОстатки.ДокументРеализации)
	               |			И (ТТМ_УчетСерийныхНомеровПродукции.ДатаПроизводства = ТТМ_УчетСерийныхНомеровПродукцииОстатки.ДатаПроизводства)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СерийныеТоварыРеализации КАК СерийныеТоварыРеализации
	               |		ПО ТТМ_УчетСерийныхНомеровПродукцииОстатки.Номенклатура = СерийныеТоварыРеализации.Номенклатура
	               |ГДЕ
	               |	ТТМ_УчетСерийныхНомеровПродукции.Регистратор ССЫЛКА Документ.ЭтапПроизводства2_2
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.Склад,
	               |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.Номенклатура,
	               |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.Назначение.Заказ,
	               |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.Назначение,
	               |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.СерийныйНомер,
	               |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.ШильдЗаказан,
	               |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.Произведено,
	               |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.ДатаПроизводства,
	               |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.ДокументРеализации,
	               |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.КоличествоОстаток,
	               |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.Реализовано,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Регистратор,
	               |	СерийныеТоварыРеализации.КоличествоУпаковок
	               |ИЗ
	               |	РегистрНакопления.ТТМ_УчетСерийныхНомеровПродукции.Остатки(
	               |			,
	               |			Склад = &Склад
	               |				И Номенклатура В (&Номенклатура)
	               |				И Назначение.Заказ = &Заказ
	               |				И Произведено
	               |				И НАЧАЛОПЕРИОДА(ДатаПроизводства, ДЕНЬ) <= НАЧАЛОПЕРИОДА(&ДатаРеализации, ДЕНЬ)
	               |				И ЕСТЬNULL(ДокументРеализации, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) = ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) КАК ТТМ_УчетСерийныхНомеровПродукцииОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТТМ_УчетСерийныхНомеровПродукции КАК ТТМ_УчетСерийныхНомеровПродукции
	               |		ПО (ТТМ_УчетСерийныхНомеровПродукции.Номенклатура = ТТМ_УчетСерийныхНомеровПродукцииОстатки.Номенклатура)
	               |			И (ТТМ_УчетСерийныхНомеровПродукции.Назначение = ТТМ_УчетСерийныхНомеровПродукцииОстатки.Назначение)
	               |			И (ТТМ_УчетСерийныхНомеровПродукции.СерийныйНомер = ТТМ_УчетСерийныхНомеровПродукцииОстатки.СерийныйНомер)
	               |			И (ТТМ_УчетСерийныхНомеровПродукции.ДокументРеализации = ТТМ_УчетСерийныхНомеровПродукцииОстатки.ДокументРеализации)
	               |			И (ТТМ_УчетСерийныхНомеровПродукции.ДатаПроизводства = ТТМ_УчетСерийныхНомеровПродукцииОстатки.ДатаПроизводства),
	               |	СерийныеТоварыРеализации КАК СерийныеТоварыРеализации
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СерийныйНомер
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СерийныеТоварыРеализации.Номенклатура КАК Номенклатура,
	               |	СерийныеТоварыРеализации.КоличествоУпаковок КАК КоличествоУпаковок
	               |ИЗ
	               |	СерийныеТоварыРеализации КАК СерийныеТоварыРеализации";     
	
	#Область СтарыйЗапросСерийныхНомеров
	//"ВЫБРАТЬ
	//|	НоменклатураДополнительныеРеквизиты.Ссылка КАК СсылкаНаНоменклатуру,
	//|	НоменклатураДополнительныеРеквизиты.Свойство КАК Свойство,
	//|	НоменклатураДополнительныеРеквизиты.Значение КАК Значение
	//|ПОМЕСТИТЬ НоменклатураУчитываемаяПоСерийнымНомерам
	//|ИЗ
	//|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	//|ГДЕ
	//|	НоменклатураДополнительныеРеквизиты.Свойство = &ДопРеквизитУчетСерий
	//|	И НоменклатураДополнительныеРеквизиты.Значение = ИСТИНА
	//|	И НоменклатураДополнительныеРеквизиты.Ссылка В(&Номенклатура)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТТМ_УчетСерийныхНомеровПродукцииОстатки.Склад КАК Склад,
	//|	ТТМ_УчетСерийныхНомеровПродукцииОстатки.Номенклатура КАК Номенклатура,
	//|	ТТМ_УчетСерийныхНомеровПродукцииОстатки.Назначение.Заказ КАК НазначениеЗаказ,
	//|	ТТМ_УчетСерийныхНомеровПродукцииОстатки.Назначение КАК Назначение,
	//|	ТТМ_УчетСерийныхНомеровПродукцииОстатки.СерийныйНомер КАК СерийныйНомер,
	//|	ТТМ_УчетСерийныхНомеровПродукцииОстатки.ШильдЗаказан КАК ШильдЗаказан,
	//|	ТТМ_УчетСерийныхНомеровПродукцииОстатки.Произведено КАК Произведено,
	//|	ТТМ_УчетСерийныхНомеровПродукцииОстатки.ДатаПроизводства КАК ДатаПроизводства,
	//|	ТТМ_УчетСерийныхНомеровПродукцииОстатки.ДокументРеализации КАК ДокументРеализации,
	//|	ТТМ_УчетСерийныхНомеровПродукцииОстатки.КоличествоОстаток КАК Количество,
	//|	ТТМ_УчетСерийныхНомеровПродукцииОстатки.Реализовано КАК Реализовано,
	//|	ТТМ_УчетСерийныхНомеровПродукции.Регистратор КАК ЭтапПроизводства
	//|ИЗ
	//|	РегистрНакопления.ТТМ_УчетСерийныхНомеровПродукции.Остатки(
	//|			,
	//|			Склад = &Склад
	//|				И Номенклатура В (&Номенклатура)
	//|				И Назначение.Заказ = &Заказ
	//|				И Произведено
	//|				И НАЧАЛОПЕРИОДА(ДатаПроизводства, ДЕНЬ) <= НАЧАЛОПЕРИОДА(&ДатаРеализации, ДЕНЬ)
	//|				И ДокументРеализации = &Реализация) КАК ТТМ_УчетСерийныхНомеровПродукцииОстатки
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НоменклатураУчитываемаяПоСерийнымНомерам КАК НоменклатураУчитываемаяПоСерийнымНомерам
	//|		ПО ТТМ_УчетСерийныхНомеровПродукцииОстатки.Номенклатура = НоменклатураУчитываемаяПоСерийнымНомерам.СсылкаНаНоменклатуру
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТТМ_УчетСерийныхНомеровПродукции КАК ТТМ_УчетСерийныхНомеровПродукции
	//|		ПО (ТТМ_УчетСерийныхНомеровПродукции.Номенклатура = ТТМ_УчетСерийныхНомеровПродукцииОстатки.Номенклатура)
	//|			И (ТТМ_УчетСерийныхНомеровПродукции.Назначение = ТТМ_УчетСерийныхНомеровПродукцииОстатки.Назначение)
	//|			И (ТТМ_УчетСерийныхНомеровПродукции.СерийныйНомер = ТТМ_УчетСерийныхНомеровПродукцииОстатки.СерийныйНомер)
	//|			И (ТТМ_УчетСерийныхНомеровПродукции.ДокументРеализации = ТТМ_УчетСерийныхНомеровПродукцииОстатки.ДокументРеализации)
	//|			И (ТТМ_УчетСерийныхНомеровПродукции.ДатаПроизводства = ТТМ_УчетСерийныхНомеровПродукцииОстатки.ДатаПроизводства)
	//|ГДЕ
	//|	ТТМ_УчетСерийныхНомеровПродукции.Регистратор ССЫЛКА Документ.ЭтапПроизводства2_2
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ТТМ_УчетСерийныхНомеровПродукцииОстатки.Склад,
	//|	ТТМ_УчетСерийныхНомеровПродукцииОстатки.Номенклатура,
	//|	ТТМ_УчетСерийныхНомеровПродукцииОстатки.Назначение.Заказ,
	//|	ТТМ_УчетСерийныхНомеровПродукцииОстатки.Назначение,
	//|	ТТМ_УчетСерийныхНомеровПродукцииОстатки.СерийныйНомер,
	//|	ТТМ_УчетСерийныхНомеровПродукцииОстатки.ШильдЗаказан,
	//|	ТТМ_УчетСерийныхНомеровПродукцииОстатки.Произведено,
	//|	ТТМ_УчетСерийныхНомеровПродукцииОстатки.ДатаПроизводства,
	//|	ТТМ_УчетСерийныхНомеровПродукцииОстатки.ДокументРеализации,
	//|	ТТМ_УчетСерийныхНомеровПродукцииОстатки.КоличествоОстаток,
	//|	ТТМ_УчетСерийныхНомеровПродукцииОстатки.Реализовано,
	//|	ТТМ_УчетСерийныхНомеровПродукции.Регистратор
	//|ИЗ
	//|	РегистрНакопления.ТТМ_УчетСерийныхНомеровПродукции.Остатки(
	//|			,
	//|			Склад = &Склад
	//|				И Номенклатура В (&Номенклатура)
	//|				И Назначение.Заказ = &Заказ
	//|				И Произведено
	//|				И НАЧАЛОПЕРИОДА(ДатаПроизводства, ДЕНЬ) <= НАЧАЛОПЕРИОДА(&ДатаРеализации, ДЕНЬ)
	//|				И ЕСТЬNULL(ДокументРеализации, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) = ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) КАК ТТМ_УчетСерийныхНомеровПродукцииОстатки
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НоменклатураУчитываемаяПоСерийнымНомерам КАК НоменклатураУчитываемаяПоСерийнымНомерам
	//|		ПО ТТМ_УчетСерийныхНомеровПродукцииОстатки.Номенклатура = НоменклатураУчитываемаяПоСерийнымНомерам.СсылкаНаНоменклатуру
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТТМ_УчетСерийныхНомеровПродукции КАК ТТМ_УчетСерийныхНомеровПродукции
	//|		ПО (ТТМ_УчетСерийныхНомеровПродукции.Номенклатура = ТТМ_УчетСерийныхНомеровПродукцииОстатки.Номенклатура)
	//|			И (ТТМ_УчетСерийныхНомеровПродукции.Назначение = ТТМ_УчетСерийныхНомеровПродукцииОстатки.Назначение)
	//|			И (ТТМ_УчетСерийныхНомеровПродукции.СерийныйНомер = ТТМ_УчетСерийныхНомеровПродукцииОстатки.СерийныйНомер)
	//|			И (ТТМ_УчетСерийныхНомеровПродукции.ДокументРеализации = ТТМ_УчетСерийныхНомеровПродукцииОстатки.ДокументРеализации)
	//|			И (ТТМ_УчетСерийныхНомеровПродукции.ДатаПроизводства = ТТМ_УчетСерийныхНомеровПродукцииОстатки.ДатаПроизводства)
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	СерийныйНомер";   

	#КонецОбласти
	
	Запрос.УстановитьПараметр("Заказ", ИсточникРТУ.ЗаказКлиента);
	Запрос.УстановитьПараметр("Номенклатура", ТЗТовары.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("Склад", ИсточникРТУ.Склад);
	Запрос.УстановитьПараметр("ДатаРеализации", ИсточникРТУ.Дата); 
	Запрос.УстановитьПараметр("Реализация", ИсточникРТУ.Ссылка); 
	Запрос.УстановитьПараметр("ТоварыРеализации", ИсточникРТУ.Товары.Выгрузить(,"Номенклатура, КоличествоУпаковок"));
	
	ДополнительныйРеквизит = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","УчитываатьСерийныеНомераНоменклатуры_ТТМ");
	Запрос.УстановитьПараметр("ДопРеквизитУчетСерий", ДополнительныйРеквизит);
		
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	РезультатУчетСерий = МассивРезультатов[3];       //[0]
	РезультатЗапроса = МассивРезультатов[2];         //[1]
		
	Если РезультатУчетСерий.Пустой() Тогда 
		ЕстьВсеСерии = Истина;        
		Возврат Неопределено
	КонецЕсли;
	
	Если РезультатЗапроса.Пустой() и не РезультатУчетСерий.пустой() Тогда 
		Сообщить("Отсутствуют остатки серийных номеров для реализации продукции!"); 
		ЕстьВсеСерии = Ложь;
		Возврат Неопределено;
	КонецЕсли;    
	
	//******************************************************************************//    
	
	ТабДоступныеСерии = РезультатЗапроса.Выгрузить();    // ТабДоступныеСерии.ЗаполнитьЗначения(ПредопределенноеЗначение(Документы.РеализацияТоваровУслуг.ПустаяСсылка()),"ДокументРеализации");
	ПараметрыПоиска = Новый Структура("ДокументРеализации", ИсточникРТУ.Ссылка); 
	//ТабДоступныеСерии = Новый ТаблицаЗначений;    
	ТабСтрокиПривязанныеКРеализации = ТабДоступныеСерии.Скопировать(ПараметрыПоиска,); 
	ЕстьПривязанныеСтроки = ТабСтрокиПривязанныеКРеализации.Количество() > 0;
	
	//--
	//МассивСНпоРеализации =  ТабДоступныеСерии.НайтиСтроки(ПараметрыПоиска);
	//ЕстьПривязанныеСерии = МассивСНпоРеализации.Количество
	//--
	
	//ТЗСерии = РезультатЗапроса.Выгрузить();
	//ТЗСерии.Сортировать("СерийныйНомер");
	//ТЗПроверкаУчетаСерий = ТЗСерии.Скопировать();
	//ТЗПроверкаУчетаСерий.Колонки.Добавить("УчетСерий",Новый ОписаниеТипов("Булево"));
	//Для каждого стр из ТЗПроверкаУчетаСерий Цикл
	//	стр.УчетСерий = ТТМ_СерийныйУчет.ПроверитьУстановитьУчетСерийныхНомеров(стр.Номенклатура);//ТТМ_СерийныйУчет.ТТМНеобходимостьИспользованияСерий();   //стр.Номенклатура,ИсточникРТУ.Дата
	//КонецЦикла;
	////мСерийныеТовары = ТЗТовары.НайтиСтроки("УчетСерий",Истина);
	
	////26.06.2025             
	//ТЗПроверкаУчетаСерий.Сортировать("СерийныйНомер возр");
	//мСерийныеТовары = ТЗПроверкаУчетаСерий.НайтиСтроки(Новый Структура("УчетСерий",Истина));
	////-    
		
	ЕстьВсеСН = Истина;
	СообщениеНЕдостаточноСерийныхНомеров = "";
	//ТЗРезультат = ТЗСерии.Скопировать();
	ТЗРезультат = ТабДоступныеСерии.Скопировать();
	ТЗРезультат.Очистить();
	
	Подобрано = 0;
	Для Каждого СтрокаРеализации Из ТабДоступныеСерии Цикл
		
		ДоступныеСерийныеНомера = ТабДоступныеСерии.НайтиСтроки(Новый Структура("Номенклатура",СтрокаРеализации.Номенклатура));
		
		Если ДоступныеСерийныеНомера.Количество() < СтрокаРеализации.Количество Тогда
			СообщениеНЕдостаточноСерийныхНомеров = ?(ЗначениеЗаполнено(СообщениеНЕдостаточноСерийныхНомеров), 
														СообщениеНЕдостаточноСерийныхНомеров + символы.ПС,
														СообщениеНЕдостаточноСерийныхНомеров) + СтрокаРеализации.Номенклатура; 
			ЕстьВсеСН = Ложь;  
			Прервать;
		Иначе   
			//Если ЕстьПривязанныеСтроки Тогда 
			//	мПривязанныеКРеализацииСтроки = ТабСтрокиПривязанныеКРеализации.НайтиСтроки(Новый Структура("Номенклатура",СтрокаРеализации.Номенклатура));
			//	Если мПривязанныеКРеализацииСтроки.Количество() = СтрокаРеализации.Количество Тогда 
			
			Для н = 1 по СтрокаРеализации.Количество Цикл
				НоваяСтрока = ТЗРезультат.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаРеализации);
				НоваяСтрока.ДокументРеализации = ИсточникРТУ.Ссылка;
				Если не ЗначениеЗаполнено(НоваяСтрока.ДокументРеализации) Тогда 
					НоваяСтрока.ДокументРеализации = ИсточникРТУ.Ссылка;
				КонецЕсли;
				НоваяСтрока.Реализовано = Истина;  
				Подобрано = Подобрано + 1;
			КонецЦикла;
			
			Если Подобрано = СтрокаРеализации.КоличествоРеализации Тогда 
				Прервать;
			КонецЕсли;   
			
		КонецЕсли;
		
	КонецЦикла;       
	
	Если ЗначениеЗаполнено(СообщениеНЕдостаточноСерийныхНомеров) Тогда 
		ОбщегоНазначения.СообщитьПользователю("Не удалось подобрать достаточно серийных номеров для реализации продукции:" + Символы.ПС + СтрокаРеализации.Номенклатура);
	КонецЕсли;
	ЕстьВсеСерии = ЕстьВсеСН;
	
	//Если Не ЕстьВсеСН Тогда
	//	ТЗРезультат = ТЗРезультат.Скопировать();
	//КонецЕсли;
	
	Возврат ТЗРезультат;
	
КонецФункции  

#КонецОбласти



///////////////////////////////////////////////////////////////////////////////////
// 05.02.2026

Процедура ТТМ_ЗаказКлиентаПриПроведении(Источник, Отказ, РежимПроведения) Экспорт
	
	СоздаватьПД = Ложь;
	НастройкиПДок = Обработки.ТТМ_НастройкиУчетаТТМ.Создать().СтруктураНастроекПДок();
	КлючОбъекта = НастройкиПДок.КлючОбъекта;
	КлючНастроек = "";
	НастройкиТТМ = ТТМ_ОбщегоНазначения.ДанныеИзХОН(НастройкиПДок.КлючОбъекта);
	Если НастройкиТТМ<>Неопределено
		И НастройкиТТМ.Свойство("ПриСогласованииЗК_СоздаватьПД") Тогда
		СоздаватьПД = НастройкиТТМ.ПриСогласованииЗК_СоздаватьПД;
	КонецЕсли;
	Если Не СоздаватьПД Тогда
		Возврат;
	КонецЕсли;
	
	Если не Отказ Тогда
		Если Источник.Проведен 
			И (Источник.Статус = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению 
			Или Источник.Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт) Тогда
			
			//Если заказ клиента - на РБ (ИНН 9731060160) согласован,
			//то нужно выставить согласование на соотв. ТТМ (ИНН 6901066336) и сформировать документы
			//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
			// Данный фрагмент построен конструктором.
			// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Организации.Ссылка КАК Робо,
			|	NULL КАК ТТМ
			|ПОМЕСТИТЬ вт_Организации
			|ИЗ
			|	Справочник.Организации КАК Организации
			|ГДЕ
			|	Организации.ИНН = &ИНН_РБ
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	NULL,
			|	Организации.Ссылка
			|ИЗ
			|	Справочник.Организации КАК Организации
			|ГДЕ
			|	Организации.ИНН = &ИНН_ТТМ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	МАКСИМУМ(вт_Организации.Робо) КАК Робо,
			|	МАКСИМУМ(вт_Организации.ТТМ) КАК ТТМ
			|ИЗ
			|	вт_Организации КАК вт_Организации
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Контрагенты.Ссылка КАК Ссылка,
			|	Контрагенты.ИНН КАК ИНН
			|ПОМЕСТИТЬ вт_Трапеза
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	Контрагенты.ИНН В(&ИНН_ПроизводствоПоЗаказу)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЗаказКлиента.Ссылка КАК Заказ,
			|	ЗаказКлиента.НомерПоДаннымКлиента КАК НомерПоДаннымКлиента,
			|	ЗаказКлиента.ДатаПоДаннымКлиента КАК ДатаПоДаннымКлиента,
			|	ЗаказКлиента.Организация КАК Организация
			|ИЗ
			|	Документ.ЗаказКлиента КАК ЗаказКлиента
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_Трапеза КАК вт_Трапеза
			|		ПО ЗаказКлиента.Контрагент = вт_Трапеза.Ссылка
			|ГДЕ
			|	ЗаказКлиента.НомерПоДаннымКлиента = &НомерПоДаннымКлиента
			|	И ЗаказКлиента.ДатаПоДаннымКлиента = &ДатаПоДаннымКлиента
			|	И ЗаказКлиента.Проведен
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ вт_Организации
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ вт_Трапеза";
			
			Запрос.УстановитьПараметр("ИНН_РБ", "9731060160");
			Запрос.УстановитьПараметр("ИНН_ТТМ", "6901066336");
			Запрос.УстановитьПараметр("ИНН_ПроизводствоПоЗаказу", СтрРазделить("7714931745,9731060160",",",Ложь));
			Запрос.УстановитьПараметр("НомерПоДаннымКлиента", Источник.НомерПоДаннымКлиента);
			Запрос.УстановитьПараметр("ДатаПоДаннымКлиента", Источник.ДатаПоДаннымКлиента);
			
			РезультатЗапроса = Запрос.ВыполнитьПакет();
			
			// Для установки условий нужны ссылки на организации ТТМ и Роболабс
			//Берём из результата запроса
			ВыборкаДетальныеЗаписи = РезультатЗапроса[1].Выбрать();
			Организации = Новый Структура("Робо,ТТМ");

			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(Организации,ВыборкаДетальныеЗаписи);
			КонецЦикла;
			
			// Запрос возвращает заказы клиента с входящим номером и датой из источника
			//от клиентов Трапеза или Роболабс
			//только для них оформляется производство через этапы
			// По документу источнику если он есть в результате, формируются производственные документы
			// Если источник - Робо, то связанный заказ ТТМ тоже отмечается в том же статусе и проводится
			// проведение заказа ТТМ тоже пройдёт через эту подписку и будут созданы производственные документы
			ВыборкаДетальныеЗаписи = РезультатЗапроса[3].Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Если Источник.Ссылка = ВыборкаДетальныеЗаписи.Заказ Тогда
					СвойстваОбъекта = Новый Структура("Ссылка,Проведен,Статус,Товары");
					ЗаполнитьЗначенияСвойств(СвойстваОбъекта,Источник);
					СвойстваОбъекта.Товары = Источник.Товары.Выгрузить();
					ФормироватьЭтапы = ТТМ_ОбщегоНазначения.ДанныеИзХОН("ТТМ_ПДок").СразуФормироватьЭтапы;
					Если ФормироватьЭтапы = Неопределено Тогда
						ФормироватьЭтапы = Истина;
					КонецЕсли;
					ТТМ_Производство.СформироватьЗаказыНаПроизводство(Источник.Ссылка,СвойстваОбъекта,ФормироватьЭтапы);
				КонецЕсли;
				Если Источник.Организация = Организации.Робо
					И ВыборкаДетальныеЗаписи.Организация = Организации.ТТМ Тогда
						ЗаказТТМ = ВыборкаДетальныеЗаписи.Заказ.ПолучитьОбъект();
						ЗаказТТМ.Статус = Источник.Статус;
						ЗаказТТМ.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
			КонецЦикла;
			
			
			//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
			
		КонецЕсли;
	КонецЕсли;	
	//Источник.Статус Источник.ЭтоНовый()
КонецПроцедуры
